examples/openfoam/example_pimpleFoamYade/0/uSourceDrag

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      uSourceDrag;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0 ;

boundaryField
{

    y0
    {
        type            calculated;
        value           uniform 0;
    }


    y1
    {
        type            calculated;
        value           uniform 0;
    }


    x0 
    {
        type            cyclic;
    
    }




    x1 
    {
        type            cyclic;
    
    }


    z1 
    {
        type            cyclic;
    
    }



    z0 
    {
        type            cyclic;
    
    }

}

// ************************************************************************* //
